# 01. Data Cleaning

These are the steps included in the data cleaning proces for my personal finance tracker project.

In [78]:
# Importing packages
import pandas as pd

## Reading the data

In [79]:
# Reading data to dataframe
transactions_df = pd.read_csv("../data/raw/transactions.csv", delimiter=";", encoding="ISO-8859-1")

## Inspecting the data

In [80]:
# Insepcting five first rows
transactions_df.head()

         Dato   Beløb                            Tekst  Unnamed: 3
0  01-06-2022 -188.00             BS FITNESS WORLD A/S         NaN
1  01-06-2022  -30.00           DK-NOTA  246 BYGST 407         NaN
2  02-06-2022  -30.00   DK-NOTA  283 COOR KANTINE, 407         NaN
3  03-06-2022 -230.00  DK-NOTAZ0089 CINEMAXX FISKETORV         NaN
4  03-06-2022 -116.93  DK-NOTAZ0174 CINEMAXX FISKETORV         NaN

Below, I validate that the pulled data matches the information on my bank account. In June 2024, I had 62 transactions. This is also the number of rows in the data set. Therefore, it seems that the csv file has been downloaded and read correctly.

In [81]:
# Checking shape 
transactions_df.shape

(2252, 4)

Inspecting the columns in the data set

In [82]:
# Inspecting columns
transactions_df.columns

Index(['Dato', 'Beløb', 'Tekst', 'Unnamed: 3'], dtype='object')

## Cleaning the data

Dropping the unnamed column that is not relevant.

In [83]:
# Dropping column
transactions_df = transactions_df.drop(["Unnamed: 3"], axis=1)

# Display 5 first rows
transactions_df

            Dato    Beløb                            Tekst
0     01-06-2022  -188.00             BS FITNESS WORLD A/S
1     01-06-2022   -30.00           DK-NOTA  246 BYGST 407
2     02-06-2022   -30.00   DK-NOTA  283 COOR KANTINE, 407
3     03-06-2022  -230.00  DK-NOTAZ0089 CINEMAXX FISKETORV
4     03-06-2022  -116.93  DK-NOTAZ0174 CINEMAXX FISKETORV
...          ...      ...                              ...
2247  01-07-2024  -149.00               TV2 DK* ID 1836275
2248  01-07-2024 -1452.00         BS AKADEMIKERNES A-KASSE
2249  01-07-2024  2000.00             From StjerneOpsparin
2250  02-07-2024  9068.00                         LØNOVER.
2251  02-07-2024   -52.05                      SC.FRANPRIX

[2252 rows x 3 columns]

Renaming the columns to english with lower case

In [84]:
# Creating renaming map
rename_map = {
  "Dato": "date",
  "Beløb": "transaction_amount",
  "Tekst": "text"
}

# Applying map to rename columns
transactions_df.rename(columns=rename_map, inplace=True)

# Inspection columns to see if changes was applied
transactions_df.head()

         date  transaction_amount                             text
0  01-06-2022             -188.00             BS FITNESS WORLD A/S
1  01-06-2022              -30.00           DK-NOTA  246 BYGST 407
2  02-06-2022              -30.00   DK-NOTA  283 COOR KANTINE, 407
3  03-06-2022             -230.00  DK-NOTAZ0089 CINEMAXX FISKETORV
4  03-06-2022             -116.93  DK-NOTAZ0174 CINEMAXX FISKETORV

In the next step, I convert the date into the date time format to work with it as a date time object.

In [85]:
# Converting to date time
transactions_df["date"] = pd.to_datetime(transactions_df["date"], dayfirst=True)

# Displaying first five rows to check conversion
transactions_df.head()

        date  transaction_amount                             text
0 2022-06-01             -188.00             BS FITNESS WORLD A/S
1 2022-06-01              -30.00           DK-NOTA  246 BYGST 407
2 2022-06-02              -30.00   DK-NOTA  283 COOR KANTINE, 407
3 2022-06-03             -230.00  DK-NOTAZ0089 CINEMAXX FISKETORV
4 2022-06-03             -116.93  DK-NOTAZ0174 CINEMAXX FISKETORV

Then, I create a column indicating month and year.

In [86]:
# Creating variables
transactions_df["year"] = pd.DatetimeIndex(transactions_df['date']).year
transactions_df["month"] = transactions_df['date'].dt.strftime('%Y-%b')

# Inspecting changes
transactions_df.head()

,date,transaction_amount,text,year,month
0,2022-06-01,-188.00,BS FITNESS WORLD A/S,2022,2022-Jun
1,2022-06-01,-30.00,DK-NOTA 246 BYGST 407,2022,2022-Jun
2,2022-06-02,-30.00,"DK-NOTA 283 COOR KANTINE, 407",2022,2022-Jun
3,2022-06-03,-230.00,DK-NOTAZ0089 CINEMAXX FISKETORV,2022,2022-Jun
4,2022-06-03,-116.93,DK-NOTAZ0174 CINEMAXX FISKETORV,2022,2022-Jun

Afterwards, I will create a column indicating if a transaction is an expenditure or income.

In [87]:
# Creating column with if-else statement
transactions_df["expenditure"] = transactions_df["transaction_amount"].apply(lambda x: 1 if x < 0 else 0)
transactions_df["transaction_amount"] = transactions_df["transaction_amount"].abs()

# Displaying column
transactions_df.head()

,date,transaction_amount,text,year,month,expenditure
0,2022-06-01,188.00,BS FITNESS WORLD A/S,2022,2022-Jun,1
1,2022-06-01,30.00,DK-NOTA 246 BYGST 407,2022,2022-Jun,1
2,2022-06-02,30.00,"DK-NOTA 283 COOR KANTINE, 407",2022,2022-Jun,1
3,2022-06-03,230.00,DK-NOTAZ0089 CINEMAXX FISKETORV,2022,2022-Jun,1
4,2022-06-03,116.93,DK-NOTAZ0174 CINEMAXX FISKETORV,2022,2022-Jun,1

With a column indicating it the transaction is an expense or an income. I can change the transaction_amount so it only contains positive values.

Lastly, I output the cleaned data set in a seperate folder.

In [88]:
# Saving data set
transactions_df.to_csv("../data/clean/transactions_clean.csv")